src/cf/Enums/СпособыУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыУчетаНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринимаетсяКВычету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчитываетсяВCтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляОперацийПо0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распределяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановленДляОперацийПо0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановленУчитываетсяВCтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособыУчетаНДС/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДоступноСписание = Ложь;
	ДоступноРаспределен = Ложь;
	
	Если Параметры.Свойство("ОграничениеСпискаВыбора") Тогда
		Если Параметры.ОграничениеСпискаВыбора = "НеОграничивать" Тогда
			Возврат;
		ИначеЕсли Параметры.ОграничениеСпискаВыбора = "ДляАвансовогоОтчета" Тогда
			ДоступноСписание = Истина;
		ИначеЕсли Параметры.ОграничениеСпискаВыбора = "ДляВводаОстатков" Тогда 
			ДоступноРаспределен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету);
	ДанныеВыбора.Добавить(Перечисления.СпособыУчетаНДС.УчитываетсяВCтоимости);
	ДанныеВыбора.Добавить(Перечисления.СпособыУчетаНДС.ДляОперацийПо0);
	ДанныеВыбора.Добавить(Перечисления.СпособыУчетаНДС.Распределяется);
	
	Если ДоступноСписание Тогда
		ДанныеВыбора.Добавить(Перечисления.СпособыУчетаНДС.Списывается);
	КонецЕсли;
	
	Если ДоступноРаспределен Тогда
		ДанныеВыбора.Добавить(Перечисления.СпособыУчетаНДС.Распределен);
	КонецЕсли;

КонецПроцедуры
